Correct the data set by filing the missing Values. Based on the class notes.
Steps:
1. Identification
Display the count of missing values for each column in the dataset.
2. Imputation (Categorical Columns)
Fill missing values in the each column.
Fill missing values in dataset with the most frequent value for that column in the data.
3. Imputation (Numerical Columns)
If numeric column have any missing values, fill them with their respective column means/median.

In [43]:
import pandas as pd

In [44]:
df1=pd.read_csv("demo_sales_missing.csv")

In [45]:
df1

,OrderID,Date,Region,Product,Quantity,UnitPrice,TotalAmount,CustomerID,SalesRep,PaymentMethod
0,1001,2024-10-01,North,Laptop,5.0,1200.0,6000,201,Alice,Credit Card
1,1002,2024-10-02,South,Phone,3.0,800.0,2400,202,NaN,Debit Card
2,1003,2024-10-03,NaN,Tablet,2.0,650.0,1300,203,Bob,Cash
3,1004,2024-10-04,West,Tablet,NaN,700.0,2800,204,Charlie,NaN
4,1005,2024-10-05,East,NaN,8.0,1100.0,8800,205,Alice,UPI
5,1006,2024-10-06,South,Headphones,2.0,NaN,400,206,Diana,Credit Card
6,1007,2024-10-07,NaN,Charger,NaN,200.0,1000,207,Bob,Cash
7,1008,2024-10-08,West,Laptop,4.0,1200.0,4800,208,NaN,Debit Card
8,1009,2024-10-09,North,Phone,1.0,800.0,800,209,Alice,NaN
9,1010,2024-10-10,East,Charger,5.0,250.0,1250,210,Diana,UPI

In [46]:
df1['UnitPrice']=df1['UnitPrice'].round()

In [47]:
df1['UnitPrice'].reset_index()

   index  UnitPrice
0      0     1200.0
1      1      800.0
2      2      650.0
3      3      700.0
4      4     1100.0
5      5        NaN
6      6      200.0
7      7     1200.0
8      8      800.0
9      9      250.0

In [48]:
import numpy as np

In [49]:
add=0
c=0
for i in df1['UnitPrice']:
    if pd.notna(i):
        add=add+i
        c+=1
    else:
        continue

In [50]:
add

6900.0

In [51]:
c

9

In [52]:
avg=int(add/c)

In [53]:
avg

766

In [54]:
df1['UnitPrice']=df1['UnitPrice'].fillna(avg)

In [55]:
df1['UnitPrice'].reset_index()

   index  UnitPrice
0      0     1200.0
1      1      800.0
2      2      650.0
3      3      700.0
4      4     1100.0
5      5      766.0
6      6      200.0
7      7     1200.0
8      8      800.0
9      9      250.0

In [56]:
import numpy as np

In [57]:
a=0
d=0
for i in df1['Quantity']:
    if pd.notna(i):
        a=a+i
        d+=1
    else:
        continue

In [58]:
a

30.0

In [59]:
d

8

In [60]:
avg_quantity=int(a/d)

In [61]:
avg_quantity

3

In [62]:
df1['Quantity']=df1['Quantity'].fillna(avg_quantity)

In [63]:
df1['Quantity'].reset_index()

   index  Quantity
0      0       5.0
1      1       3.0
2      2       2.0
3      3       3.0
4      4       8.0
5      5       2.0
6      6       3.0
7      7       4.0
8      8       1.0
9      9       5.0

In [64]:
most_common_region=df1['Region'].mode()[0]
df1['Region']=df1['Region'].fillna(most_common_region)

In [65]:
df1['Region'].reset_index()

   index Region
0      0  North
1      1  South
2      2   East
3      3   West
4      4   East
5      5  South
6      6   East
7      7   West
8      8  North
9      9   East

In [66]:
most_common_product=df1['Product'].mode()[0]
df1['Product']=df1['Product'].fillna(most_common_product)

In [67]:
df1['Product'].reset_index()

   index     Product
0      0      Laptop
1      1       Phone
2      2      Tablet
3      3      Tablet
4      4     Charger
5      5  Headphones
6      6     Charger
7      7      Laptop
8      8       Phone
9      9     Charger

In [68]:
most_common_salesrep=df1['SalesRep'].mode()[0]
df1['SalesRep']=df1['SalesRep'].fillna(most_common_salesrep)

In [69]:
df1['SalesRep'].reset_index()

   index SalesRep
0      0    Alice
1      1    Alice
2      2      Bob
3      3  Charlie
4      4    Alice
5      5    Diana
6      6      Bob
7      7    Alice
8      8    Alice
9      9    Diana

In [70]:
most_common_paymentmethod=df1['PaymentMethod'].mode()[0]
df1['PaymentMethod']=df1['PaymentMethod'].fillna(most_common_paymentmethod)

In [71]:
df1['PaymentMethod'].reset_index()

   index PaymentMethod
0      0   Credit Card
1      1    Debit Card
2      2          Cash
3      3          Cash
4      4           UPI
5      5   Credit Card
6      6          Cash
7      7    Debit Card
8      8          Cash
9      9           UPI

In [72]:
df1

,OrderID,Date,Region,Product,Quantity,UnitPrice,TotalAmount,CustomerID,SalesRep,PaymentMethod
0,1001,2024-10-01,North,Laptop,5.0,1200.0,6000,201,Alice,Credit Card
1,1002,2024-10-02,South,Phone,3.0,800.0,2400,202,Alice,Debit Card
2,1003,2024-10-03,East,Tablet,2.0,650.0,1300,203,Bob,Cash
3,1004,2024-10-04,West,Tablet,3.0,700.0,2800,204,Charlie,Cash
4,1005,2024-10-05,East,Charger,8.0,1100.0,8800,205,Alice,UPI
5,1006,2024-10-06,South,Headphones,2.0,766.0,400,206,Diana,Credit Card
6,1007,2024-10-07,East,Charger,3.0,200.0,1000,207,Bob,Cash
7,1008,2024-10-08,West,Laptop,4.0,1200.0,4800,208,Alice,Debit Card
8,1009,2024-10-09,North,Phone,1.0,800.0,800,209,Alice,Cash
9,1010,2024-10-10,East,Charger,5.0,250.0,1250,210,Diana,UPI